[
    {
        "date": "2025-12-20",
        "type": "4BJ",
        "content": "Block 1. What I feel\nI feel energized and focused this morning. There's a quiet confidence building in me that I haven't felt in months. The anxiety that usually greets me at dawn is notably absent.\n\nBlock 2. What I need\nI need to protect this momentum. I need space to think without distraction. I need to trust that I'm on the right path even when I can't see the destination.\n\nBlock 3. Truth and lie\nTruth: I am becoming the person I've always wanted to be, one small choice at a time.\nLie: I need to have everything figured out before I can start.\n\nBlock 4. One action\nI will complete the most important task first, before checking email or messages.",
        "analysis": "A strong morning entry showing clear self-awareness. The shift from anxiety to confidence suggests real progress in emotional regulation. The truth about becoming vs. the lie about needing everything figured out reveals someone moving from perfectionism toward action."
    },
    {
        "date": "2025-12-19",
        "type": "4BJ",
        "content": "Block 1. What I feel\nI feel overwhelmed but grounded. There's a lot on my plate, but I'm not drowning the way I used to. I notice the stress without becoming the stress.\n\nBlock 2. What I need\nI need to remember that my worth isn't tied to my productivity. I need moments of stillness between tasks.\n\nBlock 3. Truth and lie\nTruth: I can only do what I can do today, and that is enough.\nLie: Everyone else has it more together than me.\n\nBlock 4. One action\nI will take three deep breaths before responding to anything that triggers me today.",
        "analysis": "The phrase 'notice the stress without becoming the stress' indicates developing mindfulness skills. The comparison lie is a common cognitive distortion that's being actively challenged."
    },
    {
        "date": "2025-12-19",
        "type": "3SR",
        "content": "What mattered\nI held my boundaries even when it was uncomfortable. I said no when I meant no.\n\nWhat I learned\nDisappointing someone is not the same as harming them.\n\nWhat I release\nI release the guilt of prioritizing myself.",
        "analysis": "Powerful entry about boundary-setting. The distinction between disappointing and harming shows sophisticated emotional reasoning."
    },
    {
        "date": "2025-12-18",
        "type": "4BJ",
        "content": "Block 1. What I feel\nI feel tender today. Like something old is healing and it's uncomfortable. There's grief mixed with hope.\n\nBlock 2. What I need\nI need to be gentle with myself. I need to remember that healing isn't linear.\n\nBlock 3. Truth and lie\nTruth: The fact that old wounds still hurt doesn't mean I haven't grown.\nLie: I should be over this by now.\n\nBlock 4. One action\nI will let myself feel whatever comes up without judging it.",
        "analysis": "Deep emotional processing happening here. The 'should be over this' lie reveals leftover shame about the pace of healing. The action to feel without judging shows commitment to self-compassion."
    },
    {
        "date": "2025-12-18",
        "type": "3SR",
        "content": "What mattered\nI finished the project I've been procrastinating on for weeks. It wasn't perfect, but it's done.\n\nWhat I learned\nDone is better than perfect. Shipping something imperfect beats polishing something invisible.\n\nWhat I release\nI release the version of me that waits for the perfect moment.",
        "analysis": "Classic breakthrough from perfectionism to action. The framing of 'releasing a version of myself' shows the ability to see personal growth as identity evolution."
    },
    {
        "date": "2025-12-17",
        "type": "4BJ",
        "content": "Block 1. What I feel\nI feel restless. My mind keeps jumping to the future, worrying about things that haven't happened yet. There's an underlying hum of anxiety that I'm trying to understand rather than fight.\n\nBlock 2. What I need\nI need to come back to the present moment. I need to trust that I'll handle whatever comes when it comes.\n\nBlock 3. Truth and lie\nTruth: I have survived 100% of my worst days so far.\nLie: If I worry enough, I can prevent bad things from happening.\n\nBlock 4. One action\nWhen I notice my mind racing, I will name three things I can see right now.",
        "analysis": "Excellent anxiety management strategy emerging. The 'worry as prevention' lie is one of the most common cognitive distortions, and naming it is the first step to releasing it."
    },
    {
        "date": "2025-12-17",
        "type": "3SR",
        "content": "What mattered\nI asked for help instead of struggling alone. The world didn't end.\n\nWhat I learned\nVulnerability is a strength I'm still learning to use.\n\nWhat I release\nI release the belief that needing help means I'm weak.",
        "analysis": "Major growth in this entry. Asking for help and reframing vulnerability as strength indicates significant emotional development."
    },
    {
        "date": "2025-12-16",
        "type": "4BJ",
        "content": "Block 1. What I feel\nI feel grateful this morning. Simple things are landing differently—the coffee, the quiet, the fact that I'm here at all.\n\nBlock 2. What I need\nI need to remember this feeling when things get hard. I need to anchor to gratitude as a practice, not just a mood.\n\nBlock 3. Truth and lie\nTruth: The good moments are just as real as the hard ones.\nLie: Enjoying things means I'm not taking life seriously enough.\n\nBlock 4. One action\nI will write down three things I'm grateful for before bed tonight.",
        "analysis": "A gratitude-focused entry that also reveals an interesting lie about enjoying life. This suggests someone healing from a pattern of over-seriousness or guilt around pleasure."
    },
    {
        "date": "2025-12-16",
        "type": "3SR",
        "content": "What mattered\nI chose rest instead of pushing through. My body thanked me.\n\nWhat I learned\nRest is productive. Recovery is not laziness.\n\nWhat I release\nI release the hustle mentality that burned me out before.",
        "analysis": "Important pattern break from overworking. The explicit rejection of hustle culture shows evolving relationship with productivity and self-worth."
    },
    {
        "date": "2025-12-15",
        "type": "4BJ",
        "content": "Block 1. What I feel\nI feel uncertain but curious. There's a decision looming and I don't know the right answer. Instead of panicking, I'm trying to sit with not knowing.\n\nBlock 2. What I need\nI need to trust my intuition more. I need to stop collecting opinions and start listening to myself.\n\nBlock 3. Truth and lie\nTruth: I usually know what I need to do. The hard part is doing it.\nLie: More information will make this decision easier.\n\nBlock 4. One action\nI will make the decision by end of day, even if it's not perfect.",
        "analysis": "Excellent awareness of decision paralysis and information-seeking as avoidance. The commitment to decide 'even if not perfect' shows growing trust in self."
    },
    {
        "date": "2025-12-15",
        "type": "3SR",
        "content": "What mattered\nI had a real conversation instead of a polite one. It was uncomfortable and necessary.\n\nWhat I learned\nAuthenticity requires courage. Politeness can be a hiding place.\n\nWhat I release\nI release the need to be liked at the expense of being known.",
        "analysis": "Profound insight about authenticity vs. approval-seeking. The phrase 'liked vs. known' captures a core human tension beautifully."
    },
    {
        "date": "2025-12-14",
        "type": "4BJ",
        "content": "Block 1. What I feel\nI feel proud of myself today. Not for anything huge, but for showing up consistently. The small wins are adding up.\n\nBlock 2. What I need\nI need to celebrate progress, not just achievements. I need to acknowledge how far I've come.\n\nBlock 3. Truth and lie\nTruth: Consistency matters more than intensity.\nLie: It only counts if it's impressive.\n\nBlock 4. One action\nI will acknowledge one thing I did well today before bed.",
        "analysis": "Healthy shift from achievement-focus to process-focus. The lie about 'only counting if impressive' reveals high standards being consciously loosened."
    },
    {
        "date": "2025-12-14",
        "type": "3SR",
        "content": "What mattered\nI let go of a friendship that was draining me. It hurt, but it was honest.\n\nWhat I learned\nSome relationships are seasons, not lifetimes. Endings aren't failures.\n\nWhat I release\nI release the guilt of outgrowing someone I once needed.",
        "analysis": "Mature processing of relationship ending. Reframing endings as natural rather than failure shows healthy attachment perspective."
    },
    {
        "date": "2025-12-13",
        "type": "4BJ",
        "content": "Block 1. What I feel\nI feel calm in a way that used to scare me. Like I'm waiting for the other shoe to drop. But maybe peace is just peace.\n\nBlock 2. What I need\nI need to let myself be okay without waiting for disaster. I need to trust that calm can last.\n\nBlock 3. Truth and lie\nTruth: I am allowed to feel good.\nLie: Happiness is just the calm before the storm.\n\nBlock 4. One action\nI will notice when I'm trying to find problems that don't exist.",
        "analysis": "This entry reveals a pattern of anticipatory anxiety and difficulty accepting positive states. The awareness is the first step toward rewiring this pattern."
    },
    {
        "date": "2025-12-13",
        "type": "3SR",
        "content": "What mattered\nI said what I actually thought in a meeting instead of what I thought people wanted to hear.\n\nWhat I learned\nMy perspective has value. Silence isn't always safety.\n\nWhat I release\nI release the habit of making myself smaller to fit in.",
        "analysis": "Workplace authenticity breakthrough. The realization that silence isn't safety suggests past experiences of self-silencing being actively challenged."
    },
    {
        "date": "2025-12-12",
        "type": "4BJ",
        "content": "Block 1. What I feel\nI feel hopeful. Not the naive kind, but the kind that comes from having been through hard things and knowing I can handle more.\n\nBlock 2. What I need\nI need to remember this feeling. I need to write it down so future me has evidence.\n\nBlock 3. Truth and lie\nTruth: I am stronger than I give myself credit for.\nLie: Hope is just setting myself up for disappointment.\n\nBlock 4. One action\nI will read this entry the next time I feel like giving up.",
        "analysis": "Beautiful meta-awareness in this entry. Writing to future self during a good moment shows emotional intelligence and self-care planning."
    },
    {
        "date": "2025-12-12",
        "type": "3SR",
        "content": "What mattered\nI noticed my inner critic and talked back to it. The voice got quieter.\n\nWhat I learned\nThoughts are not facts. I can choose which ones to believe.\n\nWhat I release\nI release the automatic acceptance of my harshest self-judgments.",
        "analysis": "Cognitive restructuring in action. The ability to notice, challenge, and reduce the inner critic's volume shows real therapeutic progress."
    }
]