[
    {
        "date": "2025-12-20",
        "type": "fourBlock",
        "content": "Block 1. What I feel\nI feel energized and focused this morning. There's a quiet confidence building in me that I haven't felt in months. The anxiety that usually greets me at dawn is notably absent.\n\nBlock 2. What I need\nI need to protect this momentum. I need space to think without distraction. I need to trust that I'm on the right path even when I can't see the destination.\n\nBlock 3. Truth and lie\nTruth: I am becoming the person I've always wanted to be, one small choice at a time.\nLie: I need to have everything figured out before I can start.\n\nBlock 4. One action\nI will complete the most important task first, before checking email or messages.",
        "analysis": "A strong morning entry showing clear self-awareness. The shift from anxiety to confidence suggests real progress in emotional regulation. The truth about becoming vs. the lie about needing everything figured out reveals someone moving from perfectionism toward action."
    },
    {
        "date": "2025-12-20",
        "type": "threeSentence",
        "content": "What mattered\nI had a conversation with my father that we've been avoiding for years. Nothing was resolved, but something shifted.\n\nWhat I learned\nSome doors only open when you stop trying to force them.\n\nWhat I release\nI release the need to fix everything in one conversation. Progress is enough.",
        "analysis": "This entry shows emotional maturity and the ability to hold complexity. The metaphor of doors opening naturally reflects a deeper understanding of relationships and timing."
    },
    {
        "date": "2025-12-19",
        "type": "fourBlock",
        "content": "Block 1. What I feel\nI feel overwhelmed but grounded. There's a lot on my plate, but I'm not drowning the way I used to. I notice the stress without becoming the stress.\n\nBlock 2. What I need\nI need to remember that my worth isn't tied to my productivity. I need moments of stillness between tasks.\n\nBlock 3. Truth and lie\nTruth: I can only do what I can do today, and that is enough.\nLie: Everyone else has it more together than me.\n\nBlock 4. One action\nI will take three deep breaths before responding to anything that triggers me today.",
        "analysis": "The phrase 'notice the stress without becoming the stress' indicates developing mindfulness skills. The comparison lie is a common cognitive distortion that's being actively challenged."
    },
    {
        "date": "2025-12-19",
        "type": "threeSentence",
        "content": "What mattered\nI held my boundaries even when it was uncomfortable. I said no when I meant no.\n\nWhat I learned\nDisappointing someone is not the same as harming them.\n\nWhat I release\nI release the guilt of prioritizing myself.",
        "analysis": "Powerful entry about boundary-setting. The distinction between disappointing and harming shows sophisticated emotional reasoning."
    },
    {
        "date": "2025-12-18",
        "type": "fourBlock",
        "content": "Block 1. What I feel\nI feel tender today. Like something old is healing and it's uncomfortable. There's grief mixed with hope.\n\nBlock 2. What I need\nI need to be gentle with myself. I need to remember that healing isn't linear.\n\nBlock 3. Truth and lie\nTruth: The fact that old wounds still hurt doesn't mean I haven't grown.\nLie: I should be over this by now.\n\nBlock 4. One action\nI will let myself feel whatever comes up without judging it.",
        "analysis": "Deep emotional processing happening here. The 'should be over this' lie reveals leftover shame about the pace of healing. The action to feel without judging shows commitment to self-compassion."
    },
    {
        "date": "2025-12-18",
        "type": "threeSentence",
        "content": "What mattered\nI finished the project I've been procrastinating on for weeks. It wasn't perfect, but it's done.\n\nWhat I learned\nDone is better than perfect. Shipping something imperfect beats polishing something invisible.\n\nWhat I release\nI release the version of me that waits for the perfect moment.",
        "analysis": "Classic breakthrough from perfectionism to action. The framing of 'releasing a version of myself' shows the ability to see personal growth as identity evolution."
    },
    {
        "date": "2025-12-17",
        "type": "fourBlock",
        "content": "Block 1. What I feel\nI feel restless. My mind keeps jumping to the future, worrying about things that haven't happened yet. There's an underlying hum of anxiety that I'm trying to understand rather than fight.\n\nBlock 2. What I need\nI need to come back to the present moment. I need to trust that I'll handle whatever comes when it comes.\n\nBlock 3. Truth and lie\nTruth: I have survived 100% of my worst days so far.\nLie: If I worry enough, I can prevent bad things from happening.\n\nBlock 4. One action\nWhen I notice my mind racing, I will name three things I can see right now.",
        "analysis": "Excellent anxiety management strategy emerging. The 'worry as prevention' lie is one of the most common cognitive distortions, and naming it is the first step to releasing it."
    },
    {
        "date": "2025-12-17",
        "type": "threeSentence",
        "content": "What mattered\nI asked for help instead of struggling alone. The world didn't end.\n\nWhat I learned\nVulnerability is a strength I'm still learning to use.\n\nWhat I release\nI release the belief that needing help means I'm weak.",
        "analysis": "Major growth in this entry. Asking for help and reframing vulnerability as strength indicates significant emotional development."
    },
    {
        "date": "2025-12-16",
        "type": "fourBlock",
        "content": "Block 1. What I feel\nI feel grateful this morning. Simple things are landing differently—the coffee, the quiet, the fact that I'm here at all.\n\nBlock 2. What I need\nI need to remember this feeling when things get hard. I need to anchor to gratitude as a practice, not just a mood.\n\nBlock 3. Truth and lie\nTruth: The good moments are just as real as the hard ones.\nLie: Enjoying things means I'm not taking life seriously enough.\n\nBlock 4. One action\nI will write down three things I'm grateful for before bed tonight.",
        "analysis": "A gratitude-focused entry that also reveals an interesting lie about enjoying life. This suggests someone healing from a pattern of over-seriousness or guilt around pleasure."
    },
    {
        "date": "2025-12-16",
        "type": "threeSentence",
        "content": "What mattered\nI chose rest instead of pushing through. My body thanked me.\n\nWhat I learned\nRest is productive. Recovery is not laziness.\n\nWhat I release\nI release the hustle mentality that burned me out before.",
        "analysis": "Important pattern break from overworking. The explicit rejection of hustle culture shows evolving relationship with productivity and self-worth."
    }
]